src/InformationRegisters/ИС_Сбер_Фид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Сбер_Фид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>offer_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>available</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>category</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vendor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vendor_code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>model</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>vat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>old_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>picture</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>url</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_before</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>days</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_Сбер_НастройкиВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_Сбер_НастройкиВыгрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ИС_Сбер_Фид/Ext/ManagerModule.bsl
//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #707356
Функция СформироватьЗаписиПоТовару(парНоменклатура, парЛичныйКабинет, парХарактеристика = Неопределено, парУпаковка = Неопределено) Экспорт
//Функция СформироватьЗаписиПоТовару(парНоменклатура, парЛичныйКабинет) Экспорт
//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735	
	РезультатФормирования	= Ложь;
	СтруктураЗаполнения		= Новый Структура;
	СтруктураЗаполнения.Вставить("Номенклатура",	парНоменклатура);
	СтруктураЗаполнения.Вставить("Профиль",	парЛичныйКабинет); 
	//+ ИнфоСофт Заварин К.В. 13.09.24 УА #68384
	СтруктураЗаполнения.Вставить("Характеристика",	парХарактеристика);
	//- ИнфоСофт Заварин К.В. 13.09.24 УА #68384

	
	СтруктураЗаполнения.Вставить("offer_id");
	СтруктураЗаполнения.Вставить("available");
	СтруктураЗаполнения.Вставить("category");
	СтруктураЗаполнения.Вставить("vendor");
	СтруктураЗаполнения.Вставить("vendor_code");
	СтруктураЗаполнения.Вставить("model");
	СтруктураЗаполнения.Вставить("name");
	СтруктураЗаполнения.Вставить("vat");
	
	//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
	СтруктураЗаполнения.Вставить("price");
	//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
	СтруктураЗаполнения.Вставить("old_price");
	СтруктураЗаполнения.Вставить("barcode");
	СтруктураЗаполнения.Вставить("picture");
	СтруктураЗаполнения.Вставить("description");
	СтруктураЗаполнения.Вставить("url");
	СтруктураЗаполнения.Вставить("order_before");
	СтруктураЗаполнения.Вставить("days");
	
	
	ЗапросНастроек = Новый Запрос;
	ЗапросНастроек.УстановитьПараметр("ЛичныйКабинет",парЛичныйКабинет);
	ЗапросНастроек.Текст = 
		"ВЫБРАТЬ
		|	sberНастройкиПолей.Поле					КАК Поле,
		|	sberНастройкиПолей.ЗначениеПоля			КАК ЗначениеПоля,
		|	sberНастройкиПолей.Настройка			КАК Настройка,
		|	sberНастройкиПолей.ЗначениеПоУмолчанию	КАК ЗначениеПоУмолчанию
		|ИЗ
		|	Справочник.ИС_Сбер_НастройкиВыгрузки.НастройкиПолей КАК sberНастройкиПолей
		|ГДЕ
		|	sberНастройкиПолей.Ссылка.Профиль = &ЛичныйКабинет";
	
	ВыборкаНастроек = ЗапросНастроек.Выполнить().Выбрать();
	Пока ВыборкаНастроек.Следующий() Цикл
		ИмяНастройки = СтрЗаменить(ВыборкаНастроек.Поле,"-","_");
		Если НЕ СтруктураЗаполнения.Свойство(ИмяНастройки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяНастройки = "barcode" Тогда //Уникальное поле
			ЗапросШК = Новый Запрос;
			ЗапросШК.УстановитьПараметр("Номенклатура",СтруктураЗаполнения.Номенклатура);
			//+ ИнфоСофт Заварин К.В. 16.09.24 УА #68384
			ЗапросШК.УстановитьПараметр("Характеристика", СтруктураЗаполнения.Характеристика); 
			//- ИнфоСофт Заварин К.В. 16.09.24 УА #68384
			ЗапросШК.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 5
				|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
				|ИЗ
				|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				|ГДЕ
				|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура 
				//+ ИнфоСофт Заварин К.В. 16.09.24 УА #68384
				|И 	ШтрихкодыНоменклатуры.Характеристика = &Характеристика
				//- ИнфоСофт Заварин К.В. 16.09.24 УА #68384
				|УПОРЯДОЧИТЬ ПО Штрихкод";
			ВыборкаНоменклатуры = ЗапросШК.Выполнить().Выбрать();
			
			МассивШтрихКодов = Новый Массив;
			Пока ВыборкаНоменклатуры.Следующий() Цикл
				МассивШтрихКодов.Добавить(ВыборкаНоменклатуры.Штрихкод);
			КонецЦикла;
			СтруктураЗаполнения[ИмяНастройки] = СтрСоединить(МассивШтрихКодов,", ");
		ИначеЕсли ИмяНастройки = "offer_id" Тогда
			СтруктураЗаполнения[ИмяНастройки] = ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(парНоменклатура,ВыборкаНастроек.Настройка);
		//+ ИнфоСофт Заварин К.В. 16.09.24 УА #68384
		ИначеЕсли ИмяНастройки = "vendor_code" И ВыборкаНастроек.ЗначениеПоля = "Артикул + Характеристика" Тогда
			СтруктураЗаполнения[ИмяНастройки] = ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(парНоменклатура,ВыборкаНастроек.Настройка) 
												+ СтрШаблон("%1", СтруктураЗаполнения.Характеристика);
		ИначеЕсли ИмяНастройки = "name" И ВыборкаНастроек.ЗначениеПоля = "Наименование + Характеристика" Тогда
			СтруктураЗаполнения[ИмяНастройки] = ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(парНоменклатура,ВыборкаНастроек.Настройка) 
												+ СтрШаблон(" %1", СтруктураЗаполнения.Характеристика);
		//- ИнфоСофт Заварин К.В. 16.09.24 УА #68384
		ИначеЕсли ИмяНастройки = "available" Тогда	//Уникальное поле
			СтруктураЗаполнения[ИмяНастройки] = ?(ВыборкаНастроек.ЗначениеПоля = "Доступен",Истина,Ложь);
		ИначеЕсли ИмяНастройки = "vat" Тогда		//Уникальное поле
			СтруктураЗаполнения[ИмяНастройки] = ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(парНоменклатура,ВыборкаНастроек.Настройка,,,Истина);
		ИначеЕсли ВыборкаНастроек.ЗначениеПоУмолчанию Тогда
			СтруктураЗаполнения[ИмяНастройки] = ВыборкаНастроек.ЗначениеПоля;
		//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
		ИначеЕсли ИмяНастройки = "price" И ВыборкаНастроек.ЗначениеПоля <> "Ручной ввод" Тогда
			СтруктураЗаполнения[ИмяНастройки] = ЗаполнитьЦену(парНоменклатура, парХарактеристика, парУпаковка, ВыборкаНастроек.ЗначениеПоля, парЛичныйКабинет);
		ИначеЕсли ИмяНастройки = "old_price" И ВыборкаНастроек.ЗначениеПоля <> "Ручной ввод" Тогда
		//ИначеЕсли ИмяНастройки = "old_price" Тогда	//Ведро гвоздей
				//СтруктураЗаполнения[ИмяНастройки] = ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(парНоменклатура,ВыборкаНастроек.Настройка);
			СтруктураЗаполнения[ИмяНастройки] = ЗаполнитьЦену(парНоменклатура, парХарактеристика, парУпаковка, ВыборкаНастроек.ЗначениеПоля, парЛичныйКабинет);
		//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
		Иначе
			СтруктураЗаполнения[ИмяНастройки] = ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(парНоменклатура,ВыборкаНастроек.Настройка);
		КонецЕсли;
	КонецЦикла;
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗапись,СтруктураЗаполнения);
	НоваяЗапись.Записать(Истина);
	
	РезультатФормирования = Истина;
	
	Возврат РезультатФормирования;
КонецФункции 

Функция ОпределитьЗначениеРеквизитаИлиСвойстваНоменклатуры(МассивНоменклатуры, 
															ОписаниеПоляЗначения, 
															МножественныйОтвет = Ложь,
															РасширенныйПоиск = Ложь,
															ВозвращатьЗначение = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Новый Массив;
	
	Если ВероятноJSON(ОписаниеПоляЗначения) Тогда
		СтруктураОпределения = Прочитать(ОписаниеПоляЗначения);
		НаборОпределения	= ЗначениеИзСтрокиВнутр(СтруктураОпределения.Набор);
		СвойствоОпределения	= ЗначениеИзСтрокиВнутр(СтруктураОпределения.Свойство);
		
		ДопРеквизит = НаборОпределения.ДополнительныеРеквизиты.Найти(СвойствоОпределения,"Свойство");
		ДопСвойство = НаборОпределения.ДополнительныеСведения.Найти(СвойствоОпределения,"Свойство");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Свойство",	СвойствоОпределения);
		Запрос.УстановитьПараметр("Объект",		МассивНоменклатуры);
		
		Если ДопРеквизит <> Неопределено Тогда
			Запрос.Текст = ТекстЗапросаДополнительногоРеквизитаНоменклатуры(РасширенныйПоиск);
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ВозвращаемоеЗначение.Добавить(ВыборкаЗапроса.Значение);
			КонецЦикла;
		ИначеЕсли ДопСвойство <> Неопределено Тогда
			Запрос.Текст = ТекстЗапросаДополнительногоСвойстваНоменклатуры(РасширенныйПоиск);
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ВозвращаемоеЗначение.Добавить(ВыборкаЗапроса.Значение);
			КонецЦикла;
		КонецЕсли;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект",		МассивНоменклатуры);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.%1 КАК Значение
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Ссылка В(&Объект)";
		Запрос.Текст = СтрШаблон(Запрос.Текст,ОписаниеПоляЗначения);
		
		Попытка 
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			Пока ВыборкаЗапроса.Следующий() Цикл
				ВозвращаемоеЗначение.Добавить(ВыборкаЗапроса.Значение);
			КонецЦикла;
		Исключение 
			ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонецПопытки;
		//Для Каждого элНоменклатура Из МассивНоменклатуры Цикл
		//	Попытка
		//		ЗначениеРеквизита = элНоменклатура[ОписаниеПоляЗначения];
		//		Если ТипЗнч(ЗначениеРеквизита) = Тип("Число") Тогда
		//			ВозвращаемоеЗначение.Добавить(Формат(ЗначениеРеквизита,"ЧГ=0"));
		//		Иначе
		//			ВозвращаемоеЗначение.Добавить(ЗначениеРеквизита);
		//		КонецЕсли;
		//	Исключение КонецПопытки;
		//КонецЦикла;
	КонецЕсли;
	
	МассивПриведения = Новый Массив;
	Для Каждого элНоменклатура Из ВозвращаемоеЗначение Цикл
		Если ВозвращатьЗначение Тогда
			МассивПриведения.Добавить(элНоменклатура);
		ИначеЕсли ТипЗнч(элНоменклатура) = Тип("Число") Тогда
			МассивПриведения.Добавить(Формат(элНоменклатура,"ЧГ=0"));
		Иначе
			МассивПриведения.Добавить(СокрЛП(Строка(элНоменклатура)));
		КонецЕсли;
	КонецЦикла;
	
	Если МассивПриведения.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли МножественныйОтвет Тогда
		Возврат МассивПриведения;
	Иначе
		Возврат МассивПриведения[0];
	КонецЕсли;
КонецФункции

Функция ВероятноJSON(знач входСтрока) Экспорт
	входСтрока = СокрЛП(входСтрока);
	
	СоответствиеПроверки = Новый Соответствие;
	СоответствиеПроверки.Вставить("{",0);
	СоответствиеПроверки.Вставить("}",0);
	СоответствиеПроверки.Вставить("[",0);
	СоответствиеПроверки.Вставить("]",0);
	
	Для Каждого ЭлементСоответствия Из СоответствиеПроверки Цикл
		СоответствиеПроверки.Вставить(ЭлементСоответствия.Ключ,СтрЧислоВхождений(входСтрока,ЭлементСоответствия.Ключ));
	КонецЦикла;
	
	ПохожеНаJSON = (СоответствиеПроверки.Получить("{") + СоответствиеПроверки.Получить("}") + СоответствиеПроверки.Получить("[") + СоответствиеПроверки.Получить("]") > 1);
	
	Если ПохожеНаJSON Тогда
		ПохожеНаJSON = СоответствиеПроверки.Получить("{") = СоответствиеПроверки.Получить("}");
	КонецЕсли;
	
	Если ПохожеНаJSON Тогда
		ПохожеНаJSON = СоответствиеПроверки.Получить("[") = СоответствиеПроверки.Получить("]");
	КонецЕсли;
	
	Если ПохожеНаJSON Тогда
		ПохожеНаJSON = СоответствиеПроверки.Получить(Лев(входСтрока,1)) <> Неопределено;
	КонецЕсли;
	
	Если ПохожеНаJSON Тогда
		ПохожеНаJSON = СоответствиеПроверки.Получить(Прав(входСтрока,1)) <> Неопределено;
	КонецЕсли;
	
	Возврат ПохожеНаJSON;
КонецФункции 

//Возвращает объект
Функция Прочитать(Знач Строка,СтрДат="",ФлагСоответствие=Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Строка) Тогда
		ВозвращаемоеЗначение = Строка;
		Если ВероятноJSON(Строка) Тогда
			Строка = СтрЗаменить(Строка, "¶", "");
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Строка);
			ВозвращаемоеЗначение = ПрочитатьJSON(ЧтениеJSON,ФлагСоответствие,СтрДат);
		КонецЕсли;
	Иначе
		ВозвращаемоеЗначение = Новый Структура;
	КонецЕсли;
		
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

//Возвращает строку
Функция Записать(Структура,
				ПереносСтрок = Неопределено, 
				Экранирование = Неопределено) Экспорт 
	
	Если ПереносСтрок = Неопределено Тогда	
		ПереносСтрок = ПереносСтрокJSON.Авто;
	КонецЕсли;
	Если Экранирование = Неопределено Тогда
		Экранирование = ЭкранированиеСимволовJSON.СимволыВнеASCII;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрок , Символы.Таб,,Экранирование);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	Попытка 
		ВозвращаемоеЗначение = ЗаписьJSON.Закрыть();
	Исключение
		ВозвращаемоеЗначение = Неопределено;
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ТекстЗапросаДополнительногоРеквизитаНоменклатуры(РасширенныйПоиск = Ложь)
	Если РасширенныйПоиск Тогда
		ВозвращаемыйТекст = 
			"ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Объект,
			|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
			|	И НоменклатураДополнительныеРеквизиты.Ссылка В(&Объект)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
			|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
			|ИЗ
			|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
			|ГДЕ
			|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &Свойство
			|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец В(&Объект)
			|
			|
			|
			|";
			
	Иначе
		ВозвращаемыйТекст = 
			"ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Объект,
			|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
			|	И НоменклатураДополнительныеРеквизиты.Ссылка В(&Объект)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
			|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение
			|ИЗ
			|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
			|ГДЕ
			|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &Свойство
			|	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец В(&Объект)
			|";
	КонецЕсли;
	
	Возврат ВозвращаемыйТекст;
КонецФункции

Функция ТекстЗапросаДополнительногоСвойстваНоменклатуры(РасширенныйПоиск = Ложь)
	Если РасширенныйПоиск Тогда
		ВозвращаемыйТекст =
			"ВЫБРАТЬ
			|	ДополнительныеСведения.Объект КАК Объект,
			|	ДополнительныеСведения.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Свойство = &Свойство
			|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
			|	И ДополнительныеСведения.Объект В(&Объект)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДополнительныеСведения.Объект.Владелец,
			|	ДополнительныеСведения.Значение
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Свойство = &Свойство
			|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
			|	И ДополнительныеСведения.Объект.Владелец В(&Объект)";
	Иначе
		ВозвращаемыйТекст =
			"ВЫБРАТЬ
			|	ДополнительныеСведения.Объект КАК Объект,
			|	ДополнительныеСведения.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Свойство = &Свойство
			|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
			|	И ДополнительныеСведения.Объект В(&Объект)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДополнительныеСведения.Объект.Владелец,
			|	ДополнительныеСведения.Значение
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Свойство = &Свойство
			|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.ХарактеристикиНоменклатуры
			|	И ДополнительныеСведения.Объект.Владелец В(&Объект)";
	КонецЕсли;
	
	Возврат ВозвращаемыйТекст;
КонецФункции

//+ ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
Функция ЗаполнитьЦену(парНоменклатура, парХарактеристика, парУпаковка, ЗначениеНастройки, Профиль)
	
	Если ЗначениеНастройки = "Цена по настройкам профиля" Тогда   
		
		МассивПараметров = Новый Массив;		
		МассивПараметров.Добавить("ВидЦены");
		
		Результат = ИС_MP_Сервер.ПолучитьЗначениеНастроек(Профиль, Перечисления.ИС_МП_Маркетплейсы.Сбер, МассивПараметров);
		
		ВидЦены = Результат.ВидЦены;
	Иначе
		ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(ЗначениеНастройки);
	КонецЕсли;
	
	ИспользуетсяЦенообразование25 = Не Метаданные.ФункциональныеОпции.Найти("ИспользуетсяЦенообразование25")
		= Неопределено И ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25"); 
		
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатуры.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	нСтр = ТаблицаНоменклатуры.Добавить();
	нСтр.Номенклатура = парНоменклатура;
	нСтр.Характеристика = парХарактеристика;
	нСтр.Упаковка = парУпаковка;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатуры
		|ИЗ
		|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	НаборыУпаковок.Ссылка КАК НаборУпаковок,
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Упаковка
		|ПОМЕСТИТЬ вт_Упаковки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (НаборыУпаковок.Ссылка = УпаковкиЕдиницыИзмерения.Владелец)
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И НЕ Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	НаборыУпаковок.Ссылка,
		|	УпаковкиЕдиницыИзмерения.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО Номенклатура.НаборУпаковок = НаборыУпаковок.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО Номенклатура.Ссылка = УпаковкиЕдиницыИзмерения.Владелец
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И Номенклатура.ИспользоватьУпаковки
		|	И Номенклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
		|	И Номенклатура.Ссылка В
		|			(ВЫБРАТЬ
		|				вт_ТаблицаНоменклатуры.Номенклатура
		|			ИЗ
		|				вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Упаковки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) КАК Упаковка
		|ПОМЕСТИТЬ вт_КоличествоУпаковок
		|ИЗ
		|	вт_Упаковки КАК вт_Упаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Упаковки.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вт_Упаковки.Упаковка) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_КоличествоУпаковок.Номенклатура КАК Номенклатура,
		|	вт_Упаковки.Упаковка КАК Упаковка
		|ПОМЕСТИТЬ вт_УпаковкаПоУмолчанию
		|ИЗ
		|	вт_КоличествоУпаковок КАК вт_КоличествоУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Упаковки КАК вт_Упаковки
		|		ПО вт_КоличествоУпаковок.Номенклатура = вт_Упаковки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА вт_ТаблицаНоменклатуры.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|				И НЕ вт_УпаковкаПоУмолчанию.Упаковка ЕСТЬ NULL
		|			ТОГДА вт_УпаковкаПоУмолчанию.Упаковка
		|		ИНАЧЕ вт_ТаблицаНоменклатуры.Упаковка
		|	КОНЕЦ КАК Упаковка,
		|	вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ вт_ТаблицаНоменклатурыДополненная
		|ИЗ
		|	вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_УпаковкаПоУмолчанию КАК вт_УпаковкаПоУмолчанию
		|		ПО вт_ТаблицаНоменклатуры.Номенклатура = вт_УпаковкаПоУмолчанию.Номенклатура
		|;" 
		
		+ ?(ИспользуетсяЦенообразование25,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			(Номенклатура, ХарактеристикаЦО) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					ВЫБОР
		|						КОГДА вт_ТаблицаНоменклатуры.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|							ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|						ИНАЧЕ вт_ТаблицаНоменклатуры.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования
		|					КОНЕЦ
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)		
		|;"
		
		,
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|	КОНЕЦ КАК Числитель,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|	КОНЕЦ КАК Знаменатель,
		|	ЦеныНоменклатурыСрезПоследних.Период КАК ДатаУстановкиЦены,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыСрезПоследних.Цена * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК ЧИСЛО(15, 2)) КАК Цена
		|ПОМЕСТИТЬ вт_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			, 		
		|			(Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					вт_ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|					вт_ТаблицаНоменклатуры.Характеристика КАК Характеристика
		|				ИЗ
		|					вт_ТаблицаНоменклатуры КАК вт_ТаблицаНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (ЦеныНоменклатурыСрезПоследних.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)		
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)		
		|;") 
		
		+ 
		
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	вт_ТаблицаНоменклатурыДополненная.Номенклатура КАК Номенклатура,
		|	вт_ТаблицаНоменклатурыДополненная.Характеристика КАК Характеристика,
		|	вт_ТаблицаНоменклатурыДополненная.Упаковка КАК Упаковка,
		|	ВЫБОР
		|		КОГДА вт_цены_price.Упаковка = вт_ТаблицаНоменклатурыДополненная.Упаковка
		|			ТОГДА ЕСТЬNULL(вт_цены_price.Цена, 0)
		|		ИНАЧЕ ЕСТЬNULL(вт_цены_price.Цена, 0) * ЕСТЬNULL(вт_цены_price.Знаменатель, 1) / ЕСТЬNULL(вт_цены_price.Числитель, 1) / ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Знаменатель, 1)
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЕСТЬNULL(УпаковкиЕдиницыИзмерения.Числитель, 1)
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	вт_ТаблицаНоменклатурыДополненная КАК вт_ТаблицаНоменклатурыДополненная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Упаковка = УпаковкиЕдиницыИзмерения.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЦеныНоменклатуры КАК вт_цены_price"
		
		+ ?(ИспользуетсяЦенообразование25, 
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (ВЫБОР
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) = вт_цены_price.Характеристика
		|				ИНАЧЕ вт_ТаблицаНоменклатурыДополненная.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = вт_цены_price.Характеристика
		|			КОНЕЦ)
		|			И (ВЫБОР 
		|				КОГДА вт_ТаблицаНоменклатурыДополненная.Номенклатура.ВидНоменклатуры.НастройкиКлючаЦенПоУпаковке =  Значение(Перечисление.ВариантОтбораДляКлючаЦен.Использовать) 
		|					ТОГДА вт_ТаблицаНоменклатурыДополненная.Упаковка =  вт_цены_price.Упаковка
		|				ИНАЧЕ
		|					Истина
		|				КОНЕЦ)
		|			И (вт_цены_price.ВидЦены = &price)"
		
		,
		
		"
		|		ПО (вт_ТаблицаНоменклатурыДополненная.Номенклатура = вт_цены_price.Номенклатура)
		|			И (вт_ТаблицаНоменклатурыДополненная.Характеристика = вт_цены_price.Характеристика)
		|			И (вт_цены_price.ВидЦены = &price)");
		
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("price", ВидЦены);	

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
КонецФункции//- ИнфоСофт Стояк Ю.К. 19.08.2024 УА #70735
